{"name":"uk-attitudes-to-offensive-language-and-gestures-data","title":"UK attitudes to offensive language and gestures data","description":"Data from media research on attitudes to offensive language and gestures in the UK. The research was performed for the UK's media regulator, Ofcom, by Ipsos MORI.\r\n\r\nThis dataset contains data from the research. The full research contains guidance on methodology and how to use the data.\r\nThe research was published on 30 September 2016.\r\n\r\nThe main report can be found at:\r\nhttps://www.ofcom.org.uk/__data/assets/pdf_file/0022/91624/OfcomOffensiveLanguage.pdf \r\nwith a quick reference guide at\r\nhttps://www.ofcom.org.uk/__data/assets/pdf_file/0023/91625/OfcomQRG-AOC.pdf\r\n\r\nThe research which created this data discusses the importance of context. Whether or not they were personally offended by specific offensive language or gestures was not usually participants’\r\nstarting point. Instead, they were more likely to reflect on the acceptability of language or gestures in a particular context,\r\nincluding whether others would be offended or harmed. Participants considered the following contextual factors\r\nparticularly important when making judgements about the acceptability of potentially offensive language on TV or radio:\r\n\r\n1. The time of broadcast, and the potential and likely audiences\r\n2. The frequency or repetition of potentially offensive language\r\n3. Audience expectations of broadcasters, programmes, genres and medium\r\n4. Audience expectations of live and pre-recorded programmes\r\n5. The role of mitigating actions such as warnings, bleeps or apologies\r\n6. The perceived tone and intent of programmes\r\n\r\n\r\nFurther details are in the full report: https://www.ofcom.org.uk/__data/assets/pdf_file/0022/91624/OfcomOffensiveLanguage.pdf ","licenses":[{"url":"https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/","title":"Open Government Licence 3.0 (United Kingdom)"}],"publishers":[{"name":"Peter Wells","web":"https://twitter.com/peterkwells"}],"resources":[{"name":"Caution","mediatype":"text/csv","description":"This file contains text on the need for caution in using the data.","path":"data/caution.csv"},{"name":"List of swearwords and offensive gestures","mediatype":"text/csv","description":"This file contains the list of swearwords and offensive gestures from the research. All fields should be self-explanatory. More detail in the research performed for the UK's media regulator, Ofcom, by Ipsos MORI.","path":"data/list-of-swearwords-and-offensive-gestures.csv"}]}